my_project_name/app/controllers/users_controller.rb

    def update
        user = User.find(params[:id])
        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1 WHERE "users"."id" = $2  [["name", "William"], ["id", 3]]

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Billy"], ["email", "billy@billy.com"]]